#include<iostream>
using namespace std;
int grp[50]	={0, 5, 10, 15, 20,
			  50, 30, 35, 40, 45,
			  100, 55, 60, 65, 70,
			  75, 80, 85, 90, 95,
			  500, 1000, 275, 250, 300, // 0~21, 22~30
			  150, 175, 150, 125, 350, 
			  400
			 };
int grp2[][6]={{ 5, 22, 23, 24, 25, 26}, // 인덱스, 5가지 진행경로 
			   {10, 27, 28, 24, 29, 30},
			   {22, 23, 24, 25, 26, 15},
			   {23, 24, 25, 26, 15, 16},
			   {24, 29, 30, 20, 21, 21},
			   {25, 26, 15, 16, 17, 18},
			   {26, 15, 16, 17, 18, 19},
			   {27, 28, 24, 29, 30, 20},
			   {28, 24, 29, 30, 20, 21},
			   {29, 30, 20, 21, 21, 21},
			   {30, 20, 21, 21, 21, 21} //10
			  };
int ans[15];
int num, now, flag;

int main(){
	scanf("%d", &num);
	for(int i=0; i<num; i++){
		scanf("%d", &ans[i]);
	}//for-i
	
	for(int i=0; i<num; i++){
		if(flag==1) break;
		if(now==5 || now==10 || (now>=22 && now<=30)){
			for(int w=0; w<=10; w++){
				if(grp2[w][0]==now){
					now=grp2[w][ans[i]];
					break;
				}//if-2
			}//for-w
		}else{
			now+=ans[i];
			if(now>=21) now=21;
		}
		if(now==21){			
			flag=1;
		}
		printf("%d ", grp[now]);
	}
	return 0;
}//main
